function [D] = Psensor(T,head,a,b,r,onum) % �ʰ� ���� ó= 'ġ�� �޴´�.
 %T�� ������ 'ġ
 %head�� ������ ����
 %onum: ��ֹ���?����
 %Mdistance(a,b,X,Y,onum)
 
 kk=0;
 noise =5; % %��'��
 C = 61;
 stop =0;
 for i = 1:1:13
   
     if (stop == 0)        
       X = T(1) + 5*(i-1)*cos(head);%5mm�� �� ������ �־��� ����8�� �̵�
       Y = T(2) + 5*(i-1)*sin(head);
       if((X>=30)&&(X<=493)&&(Y>=30)&&(Y<=348))   % �� �ȿ� ��; ��
       [d, k, kk] = Mdistance(a,b,r,X,Y,onum,kk);
       
       if(kk==1)                                 % ��ֹ�?�ȿ� ��; ��
            stop=1;
            C = 5*(i-1);
             
         for t = 1:1:5                         %�ϳ��� ���̸鼭 ��d
             X = X-t*cos(head);
             Y = Y-t*sin(head);
        [d, k, kk] = Mdistance(a,b,r,X,Y,onum,kk);
             if(kk==0)
                 C = C-t;
             end
         end
       end
     else                              % �� �ۿ� ��; ��
          C = 5*(i-1);
          xx = X;
          yy = Y;
          for t = 1:1:5                        
             X = xx-t*cos(head);
             Y = yy-t*sin(head);
             if((X>=30)&&(X<=493)&&(Y>=30)&&(Y<=348))&&(stop ==0)
                  C = C-t;
                  stop = 1;
             end
          end
       end
     end
 end
 

     if (C <= 20) %tmp�� ���� ��.
          Tmp = 1023;
     elseif ((C <=25)&&(C > 20))
           Tmp = 1023 - (((1023-756)/5)*(C-20));
     elseif ((C <= 30)&&(C > 25))
           Tmp = 756 - (((756-400)/5)*(C-25));  
     elseif ((C <=35)&&(C >30))
           Tmp = 400 - (((400-260)/5)*(C-30));   
     elseif ((C <=40)&&(C >35))
           Tmp = 260 - (((260-145)/5)*(C-35));   
     elseif ((C <=45)&&(C >40))
           Tmp = 145 - (((145-92)/5)*(C-40));  
     elseif ((C <=50)&&(C >45))
           Tmp = 92 - (((92-74)/5)*(C-45));   
     elseif ((C <=55)&&(C >50))
           Tmp = 74 - (((74-60)/5)*(C-50));  
     elseif ((C <=60)&&(C > 55))
           Tmp = 60 - (((60-48)/5)*(C-55)); 
     else
           Tmp = 0;    
     end

  D =Tmp + (rand*10-5)*1024/100; 
  if D > 1023
        D = 1023;
  elseif D < 0 
        D = 0;
  end
 
end